alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "dma2d.h"
#include "eth.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "quadspi.h"
#include "rtc.h"
#include "sai.h"
#include "sdmmc.h"
#include "spdifrx.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_audio.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "ff.h"
#include "arm_math.h"
#include "audio_equalizer.h"
#include "audio_echo.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
FATFS SDFatFs;

#define AUDIO_BUFFER_SIZE   8192
#define AUDIO_HALF_BUFFER   (AUDIO_BUFFER_SIZE / 2)
FIL WavFile;
uint8_t AudioBuffer[AUDIO_BUFFER_SIZE];
volatile uint32_t AudioRemainingBytes = 0;
volatile uint8_t  AudioPlaying = 0;
volatile uint8_t  HalfBufferNeedsFill = 0;
volatile uint8_t  FullBufferNeedsFill = 0;
volatile uint8_t AudioTrackFinished = 0;
volatile uint8_t EQEnabled = 1;
volatile uint8_t ReverbEnabled = 0;
volatile uint8_t reverbResetPending = 0;
volatile uint8_t NoiseReductionEnabled = 0;
volatile uint8_t noiseReductionResetPending = 0;

extern volatile uint8_t AudioVolume;

#define FFT_SIZE 1024
#define FFT_BANDS 16
#define EQ_LIMITER_THRESHOLD 32000.0f
#define EQ_LIMITER_RELEASE 0.05f

#define REVERB_BUFFER_ADDRESS 0xC0140000U
#define REVERB_CHANNEL_COUNT 2U
#define REVERB_COMB_COUNT 4U
#define REVERB_ALLPASS_COUNT 2U
#define REVERB_MAX_SAMPLE_RATE 48000U
#define REVERB_COMB_MAX_DELAY_MS 50U
#define REVERB_ALLPASS_MAX_DELAY_MS 8U
#define REVERB_COMB_MAX_SAMPLES \
    ((REVERB_MAX_SAMPLE_RATE * REVERB_COMB_MAX_DELAY_MS) / 1000U)
#define REVERB_ALLPASS_MAX_SAMPLES \
    ((REVERB_MAX_SAMPLE_RATE * REVERB_ALLPASS_MAX_DELAY_MS) / 1000U)
#define REVERB_MIX 0.22f
#define REVERB_FEEDBACK 0.72f
#define REVERB_DAMPING 0.25f
#define REVERB_ALLPASS_GAIN 0.50f

#define NR_FRAME_SIZE 512U
#define NR_HOP_SIZE (NR_FRAME_SIZE / 2U)
#define NR_BIN_COUNT (NR_FRAME_SIZE / 2U + 1U)
#define NR_INIT_FRAMES 12U
#define NR_OVERSUBTRACTION 2.0f
#define NR_MIN_GAIN 0.08f
#define NR_NOISE_SMOOTHING 0.97f
#define NR_GAIN_SMOOTHING 0.60f
#define NR_NOISE_UPDATE_RATIO 2.5f
#define NR_EPSILON 1.0e-12f

float32_t fftBands[FFT_BANDS];
float32_t fftBandsSmoothed[FFT_BANDS];
float32_t fftInput[FFT_SIZE];
float32_t fftOutput[FFT_SIZE];
float32_t fftMagnitude[FFT_SIZE / 2];
float32_t hannWindow[FFT_SIZE];

typedef struct
{
    float32_t inputFrame[NR_FRAME_SIZE];
    float32_t outputOverlap[NR_FRAME_SIZE];
    float32_t noisePower[NR_BIN_COUNT];
    float32_t previousGain[NR_BIN_COUNT];
    uint32_t initFrameCount;
} NoiseReductionChannel;

static NoiseReductionChannel nrLeft;
static NoiseReductionChannel nrRight;
static float32_t nrWindow[NR_FRAME_SIZE];
static float32_t nrFftInput[NR_FRAME_SIZE];
static float32_t nrFftOutput[NR_FRAME_SIZE];
static float32_t nrCurrentGain[NR_BIN_COUNT];

float32_t eqLimiterGain = 1.0f;
float32_t eqLeftBuffer[EQ_BLOCK_SIZE];
float32_t eqRightBuffer[EQ_BLOCK_SIZE];

typedef struct
{
    float32_t *buffer;
    uint32_t length;
    uint32_t index;
    float32_t dampingState;
} ReverbDelayLine;

static float32_t *const reverbBuffer =
    (float32_t *)REVERB_BUFFER_ADDRESS;
static ReverbDelayLine
    reverbComb[REVERB_CHANNEL_COUNT][REVERB_COMB_COUNT];
static ReverbDelayLine
    reverbAllpass[REVERB_CHANNEL_COUNT][REVERB_ALLPASS_COUNT];

arm_rfft_fast_instance_f32 fftInstance;
arm_rfft_fast_instance_f32 nrFftInstance;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram);

uint8_t WavPlayer_Start(const char *filename);
void WavPlayer_FillHalf(uint8_t *half);

void AudioFFT_Process(uint8_t *audioData);

void AudioEQ_Process(uint8_t *audioData);
void AudioReverb_SetEnabled(uint8_t enabled);
uint8_t AudioReverb_IsEnabled(void);
void AudioNoiseReduction_SetEnabled(uint8_t enabled);
uint8_t AudioNoiseReduction_IsEnabled(void);
static void AudioEQ_ApplyLimiter(void);
static void AudioReverb_Init(float32_t sampleRate);
static void AudioReverb_Reset(void);
static void AudioReverb_Process(void);
static void AudioNoiseReduction_Init(void);
static void AudioNoiseReduction_Reset(void);
static void AudioNoiseReduction_Process(void);
static void AudioNoiseReduction_ProcessChannel(
    NoiseReductionChannel *channel,
    float32_t *samples
);
static float32_t AudioReverb_ProcessComb(
    ReverbDelayLine *line,
    float32_t input
);
static float32_t AudioReverb_ProcessAllpass(
    ReverbDelayLine *line,
    float32_t input
);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

