alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
  AudioPlaying = 1;

  audio_status = BSP_AUDIO_OUT_Play((uint16_t *)AudioBuffer, AUDIO_BUFFER_SIZE);
  if (audio_status != AUDIO_OK)
  {
    printf("BSP_AUDIO_OUT_Play failed, status=%u\r\n", audio_status);
    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    AudioPlaying = 0;
    f_close(&WavFile);
    return 0;
  }
  printf("Playback started!\r\n");

  return 1;
}

static void AudioEQ_ApplyLimiter(void)
{
    float32_t peak = 0.0f;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t leftPeak = fabsf(eqLeftBuffer[i]);
        float32_t rightPeak = fabsf(eqRightBuffer[i]);

        if (leftPeak > peak)
        {
            peak = leftPeak;
        }

        if (rightPeak > peak)
        {
            peak = rightPeak;
        }
    }

    float32_t targetGain = 1.0f;

    if (peak > EQ_LIMITER_THRESHOLD)
    {
        targetGain = EQ_LIMITER_THRESHOLD / peak;
    }

    if (targetGain < eqLimiterGain)
    {
        eqLimiterGain = targetGain;
    }
    else
    {
        eqLimiterGain +=
            EQ_LIMITER_RELEASE * (targetGain - eqLimiterGain);
    }

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] *= eqLimiterGain;
        eqRightBuffer[i] *= eqLimiterGain;
    }
}

void AudioReverb_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (ReverbEnabled != newState)
    {
        ReverbEnabled = newState;
        reverbResetPending = 1U;
    }
}

uint8_t AudioReverb_IsEnabled(void)
{
    return ReverbEnabled;
}

static void AudioReverb_Reset(void)
{
    const uint32_t combFloatCount =
        REVERB_CHANNEL_COUNT *
        REVERB_COMB_COUNT *
        REVERB_COMB_MAX_SAMPLES;
    const uint32_t allpassFloatCount =
        REVERB_CHANNEL_COUNT *
        REVERB_ALLPASS_COUNT *
        REVERB_ALLPASS_MAX_SAMPLES;

    memset(
        reverbBuffer,
        0,
        (combFloatCount + allpassFloatCount) * sizeof(float32_t)
    );

    for (uint32_t channel = 0U;
         channel < REVERB_CHANNEL_COUNT;
         channel++)
    {
        for (uint32_t stage = 0U;
             stage < REVERB_COMB_COUNT;
             stage++)
        {
            reverbComb[channel][stage].index = 0U;
            reverbComb[channel][stage].dampingState = 0.0f;
        }

        for (uint32_t stage = 0U;
             stage < REVERB_ALLPASS_COUNT;
             stage++)
        {
            reverbAllpass[channel][stage].index = 0U;
            reverbAllpass[channel][stage].dampingState = 0.0f;
        }
    }
}

static void AudioReverb_Init(float32_t sampleRate)
{
    static const float32_t combDelayMs
        [REVERB_CHANNEL_COUNT][REVERB_COMB_COUNT] =
    {
        {29.7f, 37.1f, 41.1f, 43.7f},
        {30.9f, 38.3f, 42.3f, 44.9f}
    };
    static const float32_t allpassDelayMs
        [REVERB_CHANNEL_COUNT][REVERB_ALLPASS_COUNT] =
    {
        {5.0f, 1.7f},
        {5.5f, 2.1f}
    };

    uint32_t allpassBase =
        REVERB_CHANNEL_COUNT *
        REVERB_COMB_COUNT *
        REVERB_COMB_MAX_SAMPLES;

    for (uint32_t channel = 0U;
         channel < REVERB_CHANNEL_COUNT;
         channel++)
    {
        for (uint32_t stage = 0U;
             stage < REVERB_COMB_COUNT;
             stage++)
        {
            uint32_t slot =
                channel * REVERB_COMB_COUNT + stage;
            uint32_t length = (uint32_t)(
                sampleRate * combDelayMs[channel][stage] / 1000.0f
            );

            if (length < 1U)
            {
                length = 1U;
            }
            else if (length > REVERB_COMB_MAX_SAMPLES)
            {
                length = REVERB_COMB_MAX_SAMPLES;
            }

            reverbComb[channel][stage].buffer =
                &reverbBuffer[slot * REVERB_COMB_MAX_SAMPLES];
            reverbComb[channel][stage].length = length;
        }

        for (uint32_t stage = 0U;
             stage < REVERB_ALLPASS_COUNT;
             stage++)
        {
            uint32_t slot =
                channel * REVERB_ALLPASS_COUNT + stage;
            uint32_t length = (uint32_t)(
                sampleRate * allpassDelayMs[channel][stage] / 1000.0f
            );

            if (length < 1U)
            {
                length = 1U;
            }
            else if (length > REVERB_ALLPASS_MAX_SAMPLES)
            {
                length = REVERB_ALLPASS_MAX_SAMPLES;
            }

            reverbAllpass[channel][stage].buffer =
                &reverbBuffer[
                    allpassBase +
                    slot * REVERB_ALLPASS_MAX_SAMPLES
                ];
            reverbAllpass[channel][stage].length = length;
        }
    }

    AudioReverb_Reset();
}

static float32_t AudioReverb_ProcessComb(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* f[n] = (1-D)d[n] + D f[n-1] */
    line->dampingState =
        (1.0f - REVERB_DAMPING) * delayed +
        REVERB_DAMPING * line->dampingState;

    /* b[n] = x[n] + G f[n] */
    line->buffer[line->index] =
        input + REVERB_FEEDBACK * line->dampingState;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return delayed;
}

static float32_t AudioReverb_ProcessAllpass(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* y[n] = -G x[n] + d[n] */
    float32_t output =
        -REVERB_ALLPASS_GAIN * input + delayed;

    /* b[n] = x[n] + G y[n] */
    line->buffer[line->index] =
        input + REVERB_ALLPASS_GAIN * output;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return output;
}

static void AudioReverb_Process(void)
{
    for (uint32_t i = 0U; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t dry[REVERB_CHANNEL_COUNT] =
        {
            eqLeftBuffer[i],
            eqRightBuffer[i]
        };
        float32_t wet[REVERB_CHANNEL_COUNT] = {0.0f, 0.0f};

        for (uint32_t channel = 0U;
             channel < REVERB_CHANNEL_COUNT;
             channel++)
        {
            for (uint32_t stage = 0U;
                 stage < REVERB_COMB_COUNT;
                 stage++)
            {
                wet[channel] += AudioReverb_ProcessComb(
                    &reverbComb[channel][stage],
                    dry[channel]
                );
            }

